{"site_errors":[],"page_errors":{"terms_conditions_griduser":[{"line":"Unless defined otherwise in this Agreement below, capitalized terms in this Agreement shall have the meaning ascribed to them in the following links for Definitions & ThreeFold_Grid Concepts: [definitions](definitions) and [concepts](https://wiki.threefold.io/)","linenr":29,"msg":"link, cannot find page: definitions.\nIError(Error{\n    msg: 'cannot find the file: definitions'\n    code: 0\n})","cat":3},{"line":"You acknowledge that the Software consists of open source code which is made available to you pursuant to the terms of the relevant open-source license agreement(s) as specified in github under [https://github.com/threefoldtech](https://github.com/threefoldtech) and [https://github.com/threefoldfoundation](https://github.com/threefoldfoundation) (the \"**Open Source License(s)**\"). Your use of the Software and the TF Products is conditioned upon your compliance at all times with the terms of all applicable Open Source License(s), including without limitation all provisions governing access to source code, modification, and/or reverse engineering. You are responsible for complying with any applicable documentation, meaning any information that describes the TF Products, provides instructions or recommendations related to the configuration and/or use of the TF Products, or otherwise informs Users of their intended use, including, but not limited to content provided directly to User or published at []() or otherwise made available in conjunction with the ThreeFold_Grid, the ThreeFold_Token or the Software (“**Documentation**”) and for satisfying all technical requirements of the TF Products, including any requirements set forth in the Documentation for ensuring that the TF Products perform properly.","linenr":35,"msg":"link:EMPTY LINK: for '[]()'","cat":3}],"_sidebar":[{"line":"- [Definitions](definitions.md)","linenr":1,"msg":"link, cannot find page: definitions.md.\nIError(Error{\n    msg: 'cannot find the file: definitions.md'\n    code: 0\n})","cat":3}],"part_1_definitions":[{"line":"Unless defined otherwise in this Agreement below, capitalized terms in this Agreement shall have the meaning ascribed to them in the following links for [Definitions](definitions) (definitions) and [ThreeFold_Grid Concepts](grid_concept): (grid_concepts)","linenr":3,"msg":"link, cannot find page: definitions.\nIError(Error{\n    msg: 'cannot find the file: definitions'\n    code: 0\n})","cat":3},{"line":"Unless defined otherwise in this Agreement below, capitalized terms in this Agreement shall have the meaning ascribed to them in the following links for [Definitions](definitions) (definitions) and [ThreeFold_Grid Concepts](grid_concept): (grid_concepts)","linenr":3,"msg":"link, cannot find page: grid_concept.\nIError(Error{\n    msg: 'cannot find the file: grid_concept'\n    code: 0\n})","cat":3}],"part_8_capacity_measurement_minting":[{"line":"The details of farming (minting of TFT’s) are described on our [farming_logic threefold: faming_logic](farming_logic) and this location serves as master for the TFT minting process. The wiki is version controlled (on github), so all changes can be followed.All connected IT Capacity gets registered on the TF Chain, i.e. ThreeFolds blockchain software. Each month the TF Chain issues new TFTs and transfers them to Farmers in respect of each 3Node that remained connected to the ThreeFold_Grid during the preceding month, using the following calculation in respect of each 3Node:","linenr":9,"msg":"link, cannot find page: farming_logic.\nIError(Error{\n    msg: 'cannot find the file: farming_logic'\n    code: 0\n})","cat":3}]}}